Revit 2027 API
FamilyPointLocation.GetLocation Method
 Gets the location of the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetLocation()
Public Function GetLocation As Transform
public:
Transform^ GetLocation()
member GetLocation : unit -> Transform
Return Value
Transform
 The location of the point.
See Also
Reference
FamilyPointLocation Class
Autodesk.Revit.DB Namespace